backend/controllers/AdminController.php

    public function actions()
    {
        $model = Sitesettings::find()->orderBy(['id' => SORT_DESC])->one();
---
SELECT * FROM `hts_sitesettings` ORDER BY `id` DESC

    public function actionLogin()
    {
        if (!Yii::$app->user->isGuest) {
            return $this->redirect('index');
        }
        $this->layout = "login";
        $model = new AdminLoginForm();
        if ($model->load(Yii::$app->request->post()) && $model->login()) {
            $logindata = Admin::find()->where(['email' => $model->username])->one();//print_r($logindata->name);die();
---
SELECT * FROM `admin` WHERE `email`='admin@sajilokharidbikri.com'

    public function actionProfile()
    {
        $guestModel = new Admin();
        if (Yii::$app->user->isGuest) {
            return $this->goHome();
        }
        $id = Yii::$app->user->id;
        $model = Admin::find()->where(['id' => $id])->one();
        if ($model->load(Yii::$app->request->post())) {
            if ($model->validate(array('username', 'name'))) {
                $model->username = $_POST['Admin']['username'];
                $model->email = $_POST['Admin']['username'];
                $model->name = $_POST['Admin']['name'];
                $model->save(false);
---
SELECT * FROM `admin` WHERE `id`=1
UPDATE `admin` SET `username`='admin@sajilokharidbikri.com', `email`='admin@sajilokharidbikri.com', `updated_at`=1649762425 WHERE `id`=1

    public function actionChangepassword()
    {
        $id = Yii::$app->user->id;
        $user = Admin::find()->where(['id' => $id])->one();
---
SELECT * FROM `admin` WHERE `id`=1