backend/controllers/CategoriesController.php

    public function actions()
    {
        $model = Sitesettings::find()->orderBy(['id' => SORT_DESC])->one();
---
SELECT * FROM `hts_sitesettings` ORDER BY `id` DESC

    public function actionAdd()
    {
        $model=new Categories();
        $parentCategory = array();
        $parentCategory = Categories::find()->where(['parentCategory' => 0])->all();
        if (!empty($parentCategory)){
            $parentCategory = ArrayHelper::map($parentCategory, 'categoryId', 'name');
        }
        $filters = Filter::find()->where(['status' => 1])->all();
        $getParentdata = Categories::find()->where(['categoryId'=>$_GET['id']])->one();
        $parentAttributes = explode(',', $getParentdata->categoryAttributes);
        if(isset($_POST['Categories']))
        {
            $existcategory = Categories::find()->where(['name'=>$_POST['Categories']['name'], 'parentCategory'=>$_POST['Categories']['parentCategory']])->all();
---
SELECT * FROM `hts_categories` WHERE `parentCategory`=0
SELECT * FROM `hts_filter` WHERE `status`=1
SELECT * FROM `hts_categories` WHERE `categoryId`='168'
SELECT * FROM `hts_categories` WHERE (`name`='Plants') AND (`parentCategory`='168')

    public function actionRemove($id)
    {
        $model = $this->findModel($id);
        $products = Products::find()->where(['category'=>$id])
        ->orWhere(['subCategory'=>$id])->orWhere(['sub_subCategory'=>$id])->all();
        if(empty($products)) {
            $siteSettings =  Sitesettings::find()->orderBy(['id' => SORT_DESC])->one();
            $priorityCategories = $siteSettings->category_priority;
            if(!empty($priorityCategories)){
                $priorityCategories = Json::decode($priorityCategories, true);
                if(in_array($id, $priorityCategories)){
                    $restricedCategories = array();
                    foreach($priorityCategories as $priorityKey => $priorityCategory){
                        if($priorityCategory != $id)
                            $restricedCategories[] = $priorityCategory;
                    }
                    $filteredCategories = "";
                    if(!empty($restricedCategories))
                        $filteredCategories = Json::encode($restricedCategories);
                    $siteSettings->category_priority = $filteredCategories;
                    $siteSettings->save(false);
                }
            }
            $subcategories = Categories::find()->where(['parentCategory' => $id])->all();
            foreach($subcategories as $subcategory):
                $subcategory->delete();
            endforeach;
            $model->delete();
---
SELECT * FROM `hts_products` WHERE ((`category`='134') OR (`subCategory`='134')) OR (`sub_subCategory`='134')
SELECT * FROM `hts_sitesettings` ORDER BY `id` DESC
SELECT * FROM `hts_categories` WHERE `parentCategory`='134'
DELETE FROM `hts_categories` WHERE `categoryId`=134