backend/controllers/CurrenciesController.php

SELECT * FROM `hts_sitesettings` ORDER BY `id` DESC
---
    public function actions()
    {
         $model = Sitesettings::find()->orderBy(['id' => SORT_DESC])->one();

SELECT COUNT(*) FROM `hts_products` WHERE `currency`='$-USD'
---
    public function actionDelete($id)
    {
      $model = $this->findModel($id);
      $currencySymbol = $model->currency_symbol.'-'.$model->currency_shortcode;
      $totalProductsCount = Products::find()->where(['currency'=> $currencySymbol])->count();

SELECT * FROM `hts_currencies` WHERE `id`='19'
---
    protected function findModel($id)
    {
        if (($model = Currencies::findOne($id)) !== null) {