backend/controllers/FilterController.php

            $model->status=1;
            $model->save(false);
            $filterId = $model->id;
            Filtervalues::deleteAll(['filter_id' => $id]);
---
DELETE FROM `hts_filtervalues` WHERE `filter_id`='7'

    protected function findModel($id)
    {
        if (($model = Filter::findOne($id)) !== null) {
---
SELECT * FROM `hts_filter` WHERE `id`='7'