backend/controllers/HelpController.php

    public function actions()
    {
         $model = Sitesettings::find()->orderBy(['id' => SORT_DESC])->one();
---
SELECT * FROM `hts_sitesettings` ORDER BY `id` DESC