backend/controllers/ProductconditionsController.php

SELECT * FROM `hts_sitesettings` ORDER BY `id` DESC
---
    public function actions()
    {
         $model = Sitesettings::find()->orderBy(['id' => SORT_DESC])->one();

SELECT COUNT(*) FROM `hts_products` WHERE `productCondition`='test other product'
---
    public function actionDelete($id)
    {
        $model = $this->findModel($id);
        $productCount = Products::find()->where(['productCondition' => $model->condition])->count();

SELECT * FROM `hts_productconditions` WHERE `id`='7'
---
    protected function findModel($id)
    {
        if (($model = Productconditions::findOne($id)) !== null) {