backend/controllers/ProductsController.php

SELECT * FROM `hts_sitesettings` ORDER BY `id` DESC
---
	public function actions()
    {
         $model = Sitesettings::find()->orderBy(['id' => SORT_DESC])->one();

SELECT * FROM `hts_categories` WHERE `categoryId`='5'
SELECT * FROM `hts_productconditions`
---
	public function actionProductproperty()
	{
		if(isset($_POST)) {
		 $categoryId = yii::$app->Myclass->checkPostvalue($_POST['selectedCategory']) ? $_POST['selectedCategory'] : "";
			   $categoryModel = Categories::find()->where(['categoryId'=>$categoryId])->all();
			   $categoryProperty = Json::decode($categoryModel[0]['categoryProperty'], true);
			   $itemCondition = "";
				$itemConditionFlag = 0;
				$sitePaymentModes = yii::$app->Myclass->getSitePaymentModes();
				if(isset($_POST['productId']) && $_POST['productId'] != ""){
					$productModel = yii::$app->Myclass->getProductDetails($_POST['productId']);
					if(!empty($productModel) && $productModel->category == $_POST['selectedCategory']){
						$itemStatus = $productModel->productCondition;
						$exchangeToBuy = $productModel->exchangeToBuy;
						$myOffers = $productModel->myoffer;
						$instantBuy = $productModel->instantBuy;
					}
				}
					if ($categoryProperty['itemCondition'] == 'enable')
				{
					$itemCondition .= '<div class="form-group mt-2">
						<label>'.Yii::t('app','Product Condition').' <span class="required" style="color: red;"> *</span></label>';
						$productConditions = Productconditions::find()->all();

SELECT * FROM `hts_categories` WHERE `parentCategory`='5'
---
					}
				}

				$subCategoryModel =  Categories::find()->where(['parentCategory'=>$categoryId])->all();

SELECT * FROM `hts_products` WHERE `productId`='123'
---
    protected function findModel($id)
    {
        if (($model = Products::findOne($id)) !== null) {

SELECT * FROM `hts_photos` WHERE `name`='8631651594770.jpg'
---
public function actionRemove_blogimage()
	{
			$image = $_POST['image'];
			$photosModel = Photos::find()->where(['name' =>$image])->one();