backend/controllers/SiteController.php

SELECT * FROM `hts_sitesettings` ORDER BY `id` DESC
---
    public function actions()
    {
         $model = Sitesettings::find()->orderBy(['id' => SORT_DESC])->one();