frontend/controllers/ProductsController.php

SELECT * FROM `hts_filtervalues` WHERE `id`=''
SELECT * FROM `hts_filter` WHERE `id` IS NULL
---
    public function actionGetrangefilter()
    {
        $rangevalues = $_POST['rangevalues'];
        $getRange = explode(',', $rangevalues);
        $rangeVal = array();
        foreach ($getRange as $key => $val)
        {
            $filterVals = Filtervalues::find()->where(['id' => $val])->one();
            $filterRangevalue = Filter::find()->where(['id' => $filterVals
                ->filter_id])
                ->one();