frontend/controllers/SiteController.php

    public function beforeAction($action)
    {
        if ($this->action->id == 'getdate' || $this->action->id == 'currentloc') {
            $this->enableCsrfValidation = false;
        }
        if (parent::beforeAction($action)) {
            $settings = Sitesettings::find()->orderBy(['id' => SORT_DESC])->one();
---
SELECT * FROM `hts_sitesettings` ORDER BY `id` DESC

    public function actionIndex()
    {
        // Declaration
        $place = "";
        $lat = "";
        $lon = "";
        $offset = 0;
        $limit = 32;
        $currentdate = date("Y-m-d\T00:00:00.041\Z", time());
        $initialLoad = 0;
        //Model Access
        $siteSettings = Sitesettings::find()->orderBy(['id' => SORT_DESC])->one();
---
SELECT * FROM `hts_sitesettings` ORDER BY `id` DESC