common/components/Myclass.php

SELECT * FROM `hts_sitesettings` ORDER BY `id` DESC
---
	public static function getLogo() {
		$id = 1;
		$setting = Sitesettings::find()->orderBy(['id' => SORT_DESC])->one();

SELECT * FROM `hts_sitesettings` ORDER BY `id` DESC
---
	public static function getSitePaymentModes() {
		$id = 1;
		$setting = Sitesettings::find()->orderBy(['id' => SORT_DESC])->one();

SELECT * FROM `hts_helppages`
---
	public static function getFooterLinks() {
		$footerLinksModel = Helppages::find()->all();

SELECT * FROM `hts_sitesettings` ORDER BY `id` DESC
---
	public static function getMetaData(){
		$siteSettings = Sitesettings::find()->orderBy(['id' => SORT_DESC])->one();

SELECT * FROM `hts_sitesettings` ORDER BY `id` DESC
---
	public static function getFooterSettings() {
		$id = 1;
		$setting = Sitesettings::find()->orderBy(['id' => SORT_DESC])->one();

SELECT * FROM `hts_photos` WHERE `productId`=140
---
			public static function getProductImage($id) {
				if($id != null)
					$images = Photos::find()->where(["productId" => $id])->one();

SELECT * FROM `hts_products` WHERE `productId`='133'
---
			public static function getProductDetails($id) {
				$product =  Products::find()->where(['productId' => $id])->one();

SELECT * FROM `users` WHERE `userId`=149
---
			public static function getUserDetails($id) {
				$user =  Users::find()->where(['userId' => $id])->all();

SELECT * FROM `hts_categories` WHERE `parentCategory`=0
---
			public static function getCategory() {
				$category = Categories::find()->where(['parentCategory' => 0])->all();

SELECT * FROM `hts_categories` WHERE `categoryId`=5
---
	public static function getCatDetails($id) {
		$category = Categories::find()->where(['categoryId' => $id])->one();

SELECT * FROM `hts_currencies` WHERE `currency_shortcode`='NPR'
---
		public static function getFormattingCurrency($str,$amt) {
			$str = explode("-",$str);
			$currencies = Currencies::find()->where(['currency_shortcode' => $str[1]])->one();

SELECT * FROM `hts_sitesettings` ORDER BY `id` DESC
---
		public static function getSiteName() {
			$siteSetting = Sitesettings::find()->orderBy(['id' => SORT_DESC])->one();

SELECT * FROM `hts_sitesettings` ORDER BY `id` DESC
---
		public static function getCategoryPriority() {
			$id = 1;
			$setting = Sitesettings::find()->orderBy(['id' => SORT_DESC])->one();

SELECT * FROM `hts_categories` WHERE `parentCategory`=5
---
	public static function getSubCategory($id) {
		$subCategory =  Categories::find()->where(['parentCategory'=>$id])->all();

SELECT * FROM `hts_categories` WHERE `categoryId`=5
---
	public static function getCatImage($id) {
		$category = Categories::find()->where(['categoryId' => $id])->one();

SELECT * FROM `hts_sitesettings` ORDER BY `id` DESC
---
	public static function getsocialLoginDetails() {
		$id = 1;
		$siteSettingsModel = Sitesettings::find()->orderBy(['id' => SORT_DESC])->one();

SELECT * FROM `hts_sitesettings` ORDER BY `id` DESC
---
	public static function getSitesettings()
	{
		$id = 1;
		$siteSettingsModel = Sitesettings::find()->orderBy(['id' => SORT_DESC])->one();