backend/models/PasswordForm.php

SELECT * FROM `admin` WHERE (`password_encrypt`='TmVwQGxAOTg0MQ==') AND (`id`=1)
---
    public function existPassword($attribute) {
        if(!empty($this->password)) {
            $id = Yii::$app->user->id;
            $check = Admin::find()->where(['password_encrypt'=>base64_encode($this->password),'id'=>$id])->one();

SELECT * FROM `admin` WHERE `username`='admin@sajilokharidbikri.com'
---
    public function verifyPassword($password)
    {
        $dbpassword = Admin::findOne(['username'=>Yii::$app->user->identity->username])->password_hash;