frontend/views/site/header.php

SELECT * FROM `hts_sitesettings` ORDER BY `id` DESC
---
} else {
  $search = "";
}
$siteSettings = Sitesettings::find()->orderBy(['id' => SORT_DESC])->one();